In [1]:
from pandas import read_csv, DataFrame

In [2]:
df = read_csv('data/everleys_data.csv')
df

     calcium      sodium
0   3.455582  112.690980
1   3.669026  125.663330
2   2.789910  105.821810
3   2.939900   98.172772
4   5.426060   97.931489
5   0.715811  120.858330
6   5.652390  112.871500
7   3.571320  112.647360
8   4.300067  132.031720
9   1.369419  118.499010
10  2.550962  117.373730
11  2.894129  134.052390
12  3.664987  105.346410
13  1.362779  123.359490
14  3.718798  125.021060
15  1.865868  112.075420
16  3.272809  117.588040
17  3.917591  101.009870

In [3]:
df_new = read_csv('data/patients.csv')
df_new

    Age  Height  Weight  Systolic  Diastolic  Smoker  Gender
0    38      71   176.0     124.0       93.0       1    Male
1    43      69   163.0     109.0       77.0       0    Male
2    38      64   131.0     125.0       83.0       0  Female
3    40      67   133.0     117.0       75.0       0  Female
4    49      64   119.0     122.0       80.0       0  Female
..  ...     ...     ...       ...        ...     ...     ...
95   25      69   171.0     128.0       99.0       1    Male
96   44      69   188.0     124.0       92.0       1    Male
97   49      70   186.0     119.0       74.0       0    Male
98   45      68   172.0     136.0       93.0       1    Male
99   48      66   177.0     114.0       86.0       0    Male

[100 rows x 7 columns]

In [4]:
df.head()

    calcium      sodium
0  3.455582  112.690980
1  3.669026  125.663330
2  2.789910  105.821810
3  2.939900   98.172772
4  5.426060   97.931489

In [6]:
df.head(10)

    calcium      sodium
0  3.455582  112.690980
1  3.669026  125.663330
2  2.789910  105.821810
3  2.939900   98.172772
4  5.426060   97.931489
5  0.715811  120.858330
6  5.652390  112.871500
7  3.571320  112.647360
8  4.300067  132.031720
9  1.369419  118.499010

In [7]:
len(df)

18

In [8]:
len(df.columns)

2

In [6]:
df.count()

calcium    18
sodium     18
dtype: int64

In [16]:
df.shape

(18, 2)

In [10]:
df.iloc[:, :]

     calcium      sodium
0   3.455582  112.690980
1   3.669026  125.663330
2   2.789910  105.821810
3   2.939900   98.172772
4   5.426060   97.931489
5   0.715811  120.858330
6   5.652390  112.871500
7   3.571320  112.647360
8   4.300067  132.031720
9   1.369419  118.499010
10  2.550962  117.373730
11  2.894129  134.052390
12  3.664987  105.346410
13  1.362779  123.359490
14  3.718798  125.021060
15  1.865868  112.075420
16  3.272809  117.588040
17  3.917591  101.009870

In [9]:
df.iloc[1:3, :]

    calcium     sodium
1  3.669026  125.66333
2  2.789910  105.82181

In [11]:
df.iloc[1:3, 0]

1    3.669026
2    2.789910
Name: calcium, dtype: float64

# Convert to Numpy Array

In [17]:
data = df.to_numpy()

data

array([[  3.4555817 , 112.69098   ],
       [  3.6690263 , 125.66333   ],
       [  2.7899104 , 105.82181   ],
       [  2.9399    ,  98.172772  ],
       [  5.42606   ,  97.931489  ],
       [  0.71581063, 120.85833   ],
       [  5.6523902 , 112.8715    ],
       [  3.5713201 , 112.64736   ],
       [  4.3000669 , 132.03172   ],
       [  1.3694191 , 118.49901   ],
       [  2.550962  , 117.37373   ],
       [  2.8941294 , 134.05239   ],
       [  3.6649873 , 105.34641   ],
       [  1.3627792 , 123.35949   ],
       [  3.7187978 , 125.02106   ],
       [  1.8658681 , 112.07542   ],
       [  3.2728091 , 117.58804   ],
       [  3.9175915 , 101.00987   ]])

In [18]:
data[1:3, :]

array([[  3.6690263, 125.66333  ],
       [  2.7899104, 105.82181  ]])

In [12]:
df.head()

    calcium      sodium
0  3.455582  112.690980
1  3.669026  125.663330
2  2.789910  105.821810
3  2.939900   98.172772
4  5.426060   97.931489

In [13]:
df['calcium']

0     3.455582
1     3.669026
2     2.789910
3     2.939900
4     5.426060
5     0.715811
6     5.652390
7     3.571320
8     4.300067
9     1.369419
10    2.550962
11    2.894129
12    3.664987
13    1.362779
14    3.718798
15    1.865868
16    3.272809
17    3.917591
Name: calcium, dtype: float64

In [12]:
for col in df:
    
    print(col)

calcium
sodium

In [14]:
for col in df:
    
    print(df[col])

0     3.455582
1     3.669026
2     2.789910
3     2.939900
4     5.426060
5     0.715811
6     5.652390
7     3.571320
8     4.300067
9     1.369419
10    2.550962
11    2.894129
12    3.664987
13    1.362779
14    3.718798
15    1.865868
16    3.272809
17    3.917591
Name: calcium, dtype: float64
0     112.690980
1     125.663330
2     105.821810
3      98.172772
4      97.931489
5     120.858330
6     112.871500
7     112.647360
8     132.031720
9     118.499010
10    117.373730
11    134.052390
12    105.346410
13    123.359490
14    125.021060
15    112.075420
16    117.588040
17    101.009870
Name: sodium, dtype: float64

In [17]:
for col in df:
    
    print(df[col][:3])

0    3.455582
1    3.669026
2    2.789910
Name: calcium, dtype: float64
0    112.69098
1    125.66333
2    105.82181
Name: sodium, dtype: float64

In [18]:
df.describe()

         calcium      sodium
count  18.000000   18.000000
mean    3.174301  115.167484
std     1.306652   10.756852
min     0.715811   97.931489
25%     2.610699  107.385213
50%     3.364195  115.122615
75%     3.706355  122.734200
max     5.652390  134.052390